{
  "backend/main.mo": "Actor managing publish state, subdomain and domain settings, with functions to publish, unpublish, configure domain, and reset all storage.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components used, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten one-line summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing light/dark mode OKLCH color tokens and global styling.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and mounting root element for the React app.",
  "frontend/src/App.tsx": "Root React component initializing React Query and layout, rendering the provisioning page with toaster notifications.",
  "frontend/src/components/ConnectDomainHelpSection.tsx": "Component showing DNS records, propagation info, and copy-to-clipboard actions for connecting custom domains.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, footer, branding, and page structure around main content.",
  "frontend/src/components/ProvisioningStatusPanel.tsx": "Panel displaying subdomain/domain provisioning state with live/permanent vs draft URL details and status indicators.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for checking publication status, fetching domain data, and performing publish, unpublish, domain configuration, and reset actions through an actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines extensive CSS variables for light and dark themes, including colors, layout, and typography rules.",
  "frontend/src/lib/subdomainValidation.ts": "Implements subdomain validation rules and normalization, enforcing DNS constraints and blocking a reserved subdomain.",
  "frontend/src/main.tsx": "Initializes the React app by wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/SubdomainProvisioningPage.tsx": "UI page for managing subdomain provisioning, custom domains, and publication status with validation, backend queries, and mutation actions.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, container settings, animations, and custom CSS variables for the design system.",
  "project_state.json": "Tracks project state for publishing a Caffeine site permanently and configuring DNS for jpdigitalmarketing.net. Includes existing features, new requests, issues, and architectural notes about domain setup."
}