{
  "kind": "build_request",
  "title": "Make website publish permanent and guide custom domain connection for jpdigitalmarketing.net",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the publishing UI copy to clearly explain that the provided draft URL (https://fluffy-magenta-esu-draft.caffeine.xyz/) is a preview link and that using the app’s “Publish Permanently / Publish to Production” action makes the site live permanently (does not expire).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "plz publish my website https://fluffy-magenta-esu-draft.caffeine.xyz/           permanently to internet"
        ]
      },
      "acceptanceCriteria": [
        "The publishing confirmation dialog and/or status panel explicitly states that production/live publish is permanent and draft links may expire.",
        "All user-facing text is in English.",
        "The UI shows the user which URL is considered the preview/draft URL vs the live/primary URL after publishing."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the default recommended custom domain throughout the UI from \"jpdigitalmarketing.in\" to \"jpdigitalmarketing.net\" (including default input prefill and any example/placeholder text), while still allowing the user to edit it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "plz publish my website https://fluffy-magenta-esu-draft.caffeine.xyz/           permanently to internet"
        ]
      },
      "acceptanceCriteria": [
        "When no custom domain is configured in the backend, the custom domain input is pre-filled with \"jpdigitalmarketing.net\".",
        "All example text and placeholders that reference a default custom domain use \"jpdigitalmarketing.net\".",
        "If a custom domain is already configured in the backend, the UI loads and displays that value instead of the default."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a \"Connect your domain\" help section in the provisioning/publishing page that provides the exact DNS records and values needed for iFreeDomains to point jpdigitalmarketing.net to the live site, including expected propagation time.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "plz publish my website https://fluffy-magenta-esu-draft.caffeine.xyz/           permanently to internet"
        ]
      },
      "acceptanceCriteria": [
        "The UI displays the two DNS records to add: A record host \"@\" to \"34.160.111.145\" and CNAME host \"www\" to \"cname.caffeine.xyz\".",
        "The UI mentions an expected propagation time window (e.g., 5–30 minutes).",
        "The DNS instructions are visible without requiring backend changes and are written in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui; compose them instead.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if a state upgrade is required."
  ],
  "nonGoals": [
    "Implementing automated DNS changes at iFreeDomains (manual instructions only).",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Creating a new backend database or integrating external hosting providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}